# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
#
# Напишите программу, которая вычисляет стоимость
# введенного пользователем слова. Будем считать, что на вход подается только одно слово,
# которое содержит либо только английские, либо только русские буквы.
# *Пример:*

# ноутбук
#     12

keys_1 = dict.fromkeys(["А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"], 1)
keys_2 = dict.fromkeys(["Д", "К", "Л", "М", "П", "У"], 2)
keys_3 = dict.fromkeys(["Б", "Г", "Ё", "Ь", "Я"], 3)
keys_4 = dict.fromkeys(["Й", "Ы"], 4)
keys_5 = dict.fromkeys(["Ж", "З", "Х", "Ц", "Ч"], 5)
keys_6 = dict.fromkeys(["Ш", "Э", "Ю"], 8)
keys_7 = dict.fromkeys(["Ф", "Щ", "Ъ"], 10)

keys = keys_1 | keys_2 | keys_3 | keys_4 | keys_5 | keys_6 | keys_7

x = input('Введите слово: ').upper()
sum = 0
for i in x:
    sum += keys[i]
print(sum)